**Tasks Performed**


Data Cleaning Steps:

1. Removed redundant or irrelevant columns from the dataset.

2. Standardized and renamed columns for consistency and readability.

3. Checked for duplicate records.

4. Cleaned and normalized individual columns:

    - Filtered employees with more than 8 years at the company.

    - Selected rows with "Yes" in the Attrition column.

    - Cleaned the business_travel column by replacing underscores (_) with spaces.

5. Checked for missing values (NaN) and confirmed none were present.

6. Applied additional transformations where necessary to prepare the dataset for analysis.

In [3]:
import pandas as pd

In [5]:
df= pd.read_csv('HR-Employee-Attrition-raw_data.csv')
df

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061,...,3,80,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062,...,1,80,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064,...,2,80,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065,...,4,80,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068,...,1,80,0,6,3,4,4,3,1,2

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

1. Deleting redundant columns.

In [8]:
df.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

In [9]:
columns_to_keep = ['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education','Gender','HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction', 'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager']
columns_to_drop=['EducationField', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction','MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',]

In [14]:
df[columns_to_keep]

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Female,94,3,2,Sales Executive,4,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Male,61,2,2,Research Scientist,2,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Male,92,2,1,Laboratory Technician,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Female,56,3,1,Research Scientist,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Male,40,3,1,Laboratory Technician,2,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Male,41,4,2,Laboratory Technician,4,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Male,42,2,3,Healthcare Representative,1,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Male,87,4,2,Manufacturing Director,2,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Male,63,2,2,Sales Executive,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Male,82,4,2,Laboratory Technician,3,4,3,1,2

In [15]:
df.drop(columns=columns_to_drop, inplace=True)

In [16]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Female,94,3,2,Sales Executive,4,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Male,61,2,2,Research Scientist,2,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Male,92,2,1,Laboratory Technician,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Female,56,3,1,Research Scientist,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Male,40,3,1,Laboratory Technician,2,2,2,2,2

2. Standardized and renamed columns for consistency and readability.

In [17]:
df.rename(columns={'BusinessTravel':'Busines_Travel','DailyRate':'Daily_Rate','DistanceFromHome':'Distance_From_Home','HourlyRate':'Hourly_Rate','JobInvolvement':'Job_Involvement','JobLevel':'Job_Level','JobRole':'Job_Role','JobSatisfaction':'Job_Satisfaction','YearsAtCompany':'Years_At_Company','YearsInCurrentRole':'Years_In_Current_Role','YearsSinceLastPromotion':'Years_Since_Last_Promotion','YearsWithCurrManager':'Years_With_Curr_Manager'}, inplace=True)

In [18]:
df.head()

,Age,Attrition,Busines_Travel,Daily_Rate,Department,Distance_From_Home,Education,Gender,Hourly_Rate,Job_Involvement,Job_Level,Job_Role,Job_Satisfaction,Years_At_Company,Years_In_Current_Role,Years_Since_Last_Promotion,Years_With_Curr_Manager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Female,94,3,2,Sales Executive,4,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Male,61,2,2,Research Scientist,2,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Male,92,2,1,Laboratory Technician,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Female,56,3,1,Research Scientist,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Male,40,3,1,Laboratory Technician,2,2,2,2,2

3. Removing missing values (NaN)
        No missing values were found in this dataset, so no rows needed removal.

* Missing values can be removed using:
    
    **df.dropna(inplace=True)**

In [19]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1465    False
1466    False
1467    False
1468    False
1469    False
Length: 1470, dtype: bool

In [20]:
df.duplicated().sum()

np.int64(0)

4. Cleaning individual columns

    - Filtered the dataset to include only employees who have worked at the company for more than 8 years.

    - Selected rows where the Attrition value is "Yes" to focus on employees who left the organization.

    - Cleaned the business_travel column by removing underscores (_) and replacing them with spaces for improved readability.

In [21]:
df[df["Years_At_Company"] <=8]

,Age,Attrition,Busines_Travel,Daily_Rate,Department,Distance_From_Home,Education,Gender,Hourly_Rate,Job_Involvement,Job_Level,Job_Role,Job_Satisfaction,Years_At_Company,Years_In_Current_Role,Years_Since_Last_Promotion,Years_With_Curr_Manager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Female,94,3,2,Sales Executive,4,6,4,0,5
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Male,92,2,1,Laboratory Technician,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Female,56,3,1,Research Scientist,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Male,40,3,1,Laboratory Technician,2,2,2,2,2
5,32,No,Travel_Frequently,1005,Research & Development,2,2,Male,79,3,1,Laboratory Technician,4,7,7,3,6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1464,26,No,Travel_Rarely,1167,Sales,5,3,Female,30,2,1,Sales Representative,3,4,2,0,0
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Male,41,4,2,Laboratory Technician,4,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Male,42,2,3,Healthcare Representative,1,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Male,87,4,2,Manufacturing Director,2,6,2,0,3
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Male,82,4,2,Laboratory Technician,3,4,3,1,2

In [22]:
df[df["Attrition"] == 'Yes']

,Age,Attrition,Busines_Travel,Daily_Rate,Department,Distance_From_Home,Education,Gender,Hourly_Rate,Job_Involvement,Job_Level,Job_Role,Job_Satisfaction,Years_At_Company,Years_In_Current_Role,Years_Since_Last_Promotion,Years_With_Curr_Manager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Female,94,3,2,Sales Executive,4,6,4,0,5
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Male,92,2,1,Laboratory Technician,3,0,0,0,0
14,28,Yes,Travel_Rarely,103,Research & Development,24,3,Male,50,2,1,Laboratory Technician,3,4,2,0,3
21,36,Yes,Travel_Rarely,1218,Sales,9,4,Male,82,2,1,Sales Representative,1,5,3,0,3
24,34,Yes,Travel_Rarely,699,Research & Development,6,1,Male,83,3,1,Research Scientist,1,4,2,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1438,23,Yes,Travel_Frequently,638,Sales,9,3,Male,33,3,1,Sales Representative,1,1,0,1,0
1442,29,Yes,Travel_Rarely,1092,Research & Development,1,4,Male,36,3,1,Research Scientist,4,2,2,2,2
1444,56,Yes,Travel_Rarely,310,Research & Development,7,2,Male,72,3,1,Laboratory Technician,3,10,9,9,8
1452,50,Yes,Travel_Frequently,878,Sales,1,4,Male,94,3,2,Sales Executive,3,6,3,0,1
1461,50,Yes,Travel_Rarely,410,Sales,28,3,Male,39,2,3,Sales Executive,1,3,2,2,0

In [25]:
df["Busines_Travel"] = df["Busines_Travel"].replace("_", " ", regex=True)
df.head()

,Age,Attrition,Busines_Travel,Daily_Rate,Department,Distance_From_Home,Education,Gender,Hourly_Rate,Job_Involvement,Job_Level,Job_Role,Job_Satisfaction,Years_At_Company,Years_In_Current_Role,Years_Since_Last_Promotion,Years_With_Curr_Manager
0,41,Yes,Travel Rarely,1102,Sales,1,2,Female,94,3,2,Sales Executive,4,6,4,0,5
1,49,No,Travel Frequently,279,Research & Development,8,1,Male,61,2,2,Research Scientist,2,10,7,1,7
2,37,Yes,Travel Rarely,1373,Research & Development,2,2,Male,92,2,1,Laboratory Technician,3,0,0,0,0
3,33,No,Travel Frequently,1392,Research & Development,3,4,Female,56,3,1,Research Scientist,3,8,7,3,0
4,27,No,Travel Rarely,591,Research & Development,2,1,Male,40,3,1,Laboratory Technician,2,2,2,2,2

5. Remove missing values (NaN)

        No missing values were found in this dataset, so no rows needed removal.

* Missing values can be removed using:

   **df.dropna(inplace=True)**

In [26]:
df.isna().sum()

Age                           0
Attrition                     0
Busines_Travel                0
Daily_Rate                    0
Department                    0
Distance_From_Home            0
Education                     0
Gender                        0
Hourly_Rate                   0
Job_Involvement               0
Job_Level                     0
Job_Role                      0
Job_Satisfaction              0
Years_At_Company              0
Years_In_Current_Role         0
Years_Since_Last_Promotion    0
Years_With_Curr_Manager       0
dtype: int64

6. Checked for additional transformations

* Converted the Attrition column to numeric values for analysis: "Yes" was replaced with 1 and "No" was replaced with 0.

In [27]:
df["Attrition"] = df["Attrition"].apply(lambda x:1 if x== 'Yes' else 0)

In [28]:
df["Attrition"]

0       1
1       0
2       1
3       0
4       0
       ..
1465    0
1466    0
1467    0
1468    0
1469    0
Name: Attrition, Length: 1470, dtype: int64

In [29]:
df

,Age,Attrition,Busines_Travel,Daily_Rate,Department,Distance_From_Home,Education,Gender,Hourly_Rate,Job_Involvement,Job_Level,Job_Role,Job_Satisfaction,Years_At_Company,Years_In_Current_Role,Years_Since_Last_Promotion,Years_With_Curr_Manager
0,41,1,Travel Rarely,1102,Sales,1,2,Female,94,3,2,Sales Executive,4,6,4,0,5
1,49,0,Travel Frequently,279,Research & Development,8,1,Male,61,2,2,Research Scientist,2,10,7,1,7
2,37,1,Travel Rarely,1373,Research & Development,2,2,Male,92,2,1,Laboratory Technician,3,0,0,0,0
3,33,0,Travel Frequently,1392,Research & Development,3,4,Female,56,3,1,Research Scientist,3,8,7,3,0
4,27,0,Travel Rarely,591,Research & Development,2,1,Male,40,3,1,Laboratory Technician,2,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,0,Travel Frequently,884,Research & Development,23,2,Male,41,4,2,Laboratory Technician,4,5,2,0,3
1466,39,0,Travel Rarely,613,Research & Development,6,1,Male,42,2,3,Healthcare Representative,1,7,7,1,7
1467,27,0,Travel Rarely,155,Research & Development,4,3,Male,87,4,2,Manufacturing Director,2,6,2,0,3
1468,49,0,Travel Frequently,1023,Sales,2,3,Male,63,2,2,Sales Executive,2,9,6,0,8
1469,34,0,Travel Rarely,628,Research & Development,8,3,Male,82,4,2,Laboratory Technician,3,4,3,1,2

In [30]:
df.to_csv('HR-Employee-Attrition-clean_data.csv', index=False)

**Summary**

* All redundant columns were removed, and remaining columns were standardized and cleaned.

* Duplicates and missing values were checked; none were found.

* Filters and transformations were applied to focus on relevant records (e.g., employees with >8 years, Attrition = Yes).

* Categorical values like Attrition and business_travel were cleaned and converted for easy analysis.

* The dataset is now fully cleaned and ready for analysis or modeling.